FL0WL0W/ESP32C3-W806-ECU/ESP32C3/main/http_server.cpp
    //reset w806
    httpd_resp_sendstr_chunk(req, "Resetting W806 into flash mode\r\n");
    ESP_ERROR_CHECK(uart_set_baudrate(W806_UART_NUM, 115200));
    bootreset_w806();
    reset_w806();

    auto rx_listen_callback_iterator = uart_listen_add_callback(W806_UART_NUM, [&](const uint8_t *rx_buffer, size_t len) {
        xRingbufferSend(rxbuf_handle, rx_buffer, len, pdMS_TO_TICKS(1000));
    });

    //interrupt startup
    int cnt = 0;
    unsigned char esc_key = 27;
    for (int i = 0; i < 100; i++)
    {
        uart_write_bytes(W806_UART_NUM, &esc_key, 1);
        size_t size = 0;
        char *ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(10), 1);
        if (size > 0)
        {
            if (('C' == *ch) || ('P' == *ch))
                cnt++;
            else
                cnt = 0;
            vRingbufferReturnItem(rxbuf_handle, ch);
            break;
        }
    }
    httpd_resp_sendstr_chunk(req, "Syncing\r\n");

    //sync
    int64_t start = get_timestamp(); 
    char macstr[17] = {0};
    int offset = 0;
    do
    {
        size_t size = 0;
        char *ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);

        if (size > 0)
        {
            if (('C' == *ch) || ('P' == *ch))
                cnt++;
            else
                cnt = 0;
            vRingbufferReturnItem(rxbuf_handle, ch);
        }
        else
        {
            cnt = 0;
            //reset w806
            bootreset_w806();
            reset_w806();

            for (int i = 0; i < 100; i++)
            {
                uart_write_bytes(W806_UART_NUM, &esc_key, 1);
                ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(10), 1);
                if (size > 0)
                {
                    if (('C' == *ch) || ('P' == *ch))
                        cnt++;
                    else
                        cnt = 0;
                    vRingbufferReturnItem(rxbuf_handle, ch);
                    break;
                }
            }
        }

        if((get_timestamp() - start) > 10000000)
        {
            ESP_LOGE(TAG, "Failed to sync");
            /* Respond with 500 Internal Server Error */
            httpd_resp_sendstr_chunk(req, "Failed to sync\r\n");
            ret = ESP_FAIL;
            goto upload_w806_post_handler_cleanup;
        }
    } while (cnt < 3);

    httpd_resp_sendstr_chunk(req, "Erasing\r\n");
    uart_write_bytes(W806_UART_NUM, wm_tool_chip_cmd_erase, sizeof(wm_tool_chip_cmd_erase));

    //sync
    start = get_timestamp(); 
    macstr[17] = {0};
    offset = 0;
    do
    {
        size_t size = 0;
        char *ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);

        if (size > 0)
        {
            if (('C' == *ch) || ('P' == *ch))
                cnt++;
            else
                cnt = 0;
            vRingbufferReturnItem(rxbuf_handle, ch);
        }
        else
        {
            cnt = 0;
            //reset w806
            bootreset_w806();
            reset_w806();

            for (int i = 0; i < 100; i++)
            {
                uart_write_bytes(W806_UART_NUM, &esc_key, 1);
                ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(10), 1);
                if (size > 0)
                {
                    if (('C' == *ch) || ('P' == *ch))
                        cnt++;
                    else
                        cnt = 0;
                    vRingbufferReturnItem(rxbuf_handle, ch);
                    break;
                }
            }
        }

        if((get_timestamp() - start) > 10000000)
        {
            ESP_LOGE(TAG, "Failed to sync");
            /* Respond with 500 Internal Server Error */
            httpd_resp_sendstr_chunk(req, "Failed to erase\r\n");
            ret = ESP_FAIL;
            goto upload_w806_post_handler_cleanup;
        }
    } while (cnt < 3);

    httpd_resp_sendstr_chunk(req, "Changing baud rate to 2Mhz\r\n");
    //change baud rate to 2M
    uart_write_bytes(W806_UART_NUM, wm_tool_chip_cmd_b2000000, sizeof(wm_tool_chip_cmd_b2000000));
    vTaskDelay(pdMS_TO_TICKS(100));
    ESP_ERROR_CHECK(uart_set_baudrate(W806_UART_NUM, 2000000));

    httpd_resp_sendstr_chunk(req, "Verifying connection\r\n");
    //get MAC to verify connection
    uart_write_bytes(W806_UART_NUM, wm_tool_chip_cmd_get_mac, sizeof(wm_tool_chip_cmd_get_mac));
    start = get_timestamp(); 
    do
    {
        size_t size = 0;
        char *ch = (char *)xRingbufferReceive(rxbuf_handle, &size, pdMS_TO_TICKS(1000));
        if(size > 0)
        {
            if(offset == 0) 
            {
                for(int i = 0; i < size; i++)
                {
                    if(ch[i] == 'M')
                    {
                        size_t len = size - i;
                        if(len > 16)
                            len = 16;
                        memcpy(macstr, ch + i, len);
                        offset = len;
                        break;
                    }
                }
            }
            else
            {
                size_t len = size + offset;
                if(len > 16)
                    len = 16;
                memcpy(macstr + offset, ch, len - offset);
                offset = len;
            }

            vRingbufferReturnItem(rxbuf_handle, ch);
        }

        if(offset == 16)
        {
            macstr[16] = 0;
            ESP_LOGI(TAG, "%s", macstr);
            break;
        }

        if((get_timestamp() - start) > 10000000)
        {
            ESP_LOGE(TAG, "Failed to get MAC");
            /* Respond with 500 Internal Server Error */
            httpd_resp_sendstr_chunk(req, "Failed to verify connection\r\n");
            ret = ESP_FAIL;
            goto upload_w806_post_handler_cleanup;
        }
    } while (1);

    httpd_resp_sendstr_chunk(req, "Sending File\r\n");
    while (ack_id != 0x04) {

        ESP_LOGI(TAG, "Remaining size : %d\t\tack_id : %x", remaining, ack_id);
        /* Receive the file part by part into a buffer */
        received = 0;
        if(remaining > 0) {
            if(remaining > 0 && ack_id == 0x06) {
                size_t getLen = MIN(remaining, W806_XMODEM_DATA_SIZE);
                while(received < getLen) {
                    int r;
                    if ((r = httpd_req_recv(req, buf + 3 + received, getLen - received)) <= 0) {
                        if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                            /* Retry if timeout occurred */
                            continue;
                        }

                        ESP_LOGE(TAG, "File reception failed!");
                        /* Respond with 500 Internal Server Error */
                        // httpd_resp_sendstr_chunk(req, "Failed to receive file\r\n");
                        ret = ESP_FAIL;
                        goto upload_w806_post_handler_cleanup;
                    }
                    received += r;
                }
            }
        } else {
            received = -1;
        }

        /* Write buffer content to W806 */
        switch(ack_id)
        {
            case 0x06:
            {
                httpd_resp_sendstr_chunk(req, ".");
                retry_num = 0;
                pack_counter++;

