FL0WL0W/ESP32C3-W806-ECU/ESP32C3/main/http_server.cpp
                if (received > 0)
                {
                    /* Keep track of remaining size of
                    * the file left to be uploaded */
                    remaining -= received;
                    if (received < W806_XMODEM_DATA_SIZE)
                    {
                        for ( ; received < W806_XMODEM_DATA_SIZE; received++)
                            buf[received + 3] = 0x0;
                    }

                    buf[0] = 0x02;
                    buf[1] = pack_counter;
                    buf[2] = 255 - buf[1];

                    crc_value = w806_crc16(buf + 3, W806_XMODEM_DATA_SIZE);

                    buf[W806_XMODEM_DATA_SIZE + 3]=(unsigned char)(crc_value >> 8);
                    buf[W806_XMODEM_DATA_SIZE + 4]=(unsigned char)(crc_value);

                    //send frame header
                    uart_write_bytes(W806_UART_NUM, buf, 1);

                    //clear rx buffer
                    size_t size = 0;
                    char *ch = (char *)xRingbufferReceive(rxbuf_handle, &size, 0);
                    if(size > 0)
                        vRingbufferReturnItem(rxbuf_handle, ch);

                    //send frame
                    uart_write_bytes(W806_UART_NUM, buf + 1, W806_XMODEM_DATA_SIZE + 4);

                    //wait for ACK
                    ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);
                    if(size > 0)
                        ack_id = *ch;
                    else
                        ack_id = 0x15;
                    if(size > 0)
                        vRingbufferReturnItem(rxbuf_handle, ch);
                }
                else
                {
                    ack_id = 0x04;

                    while (ack_id != 0x06)
                    {
                        ack_id = 0x04;
                        //clear rx buffer
                        size_t size = 0;
                        char *ch = (char *)xRingbufferReceive(rxbuf_handle, &size, 0);
                        if(size > 0)
                            vRingbufferReturnItem(rxbuf_handle, ch);

                        //send frame
                        uart_write_bytes(W806_UART_NUM, &ack_id, 1);

                        //wait for ACK
                        ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);
                        if(size > 0)
                            ack_id = *ch;
                        else
                            ack_id = 0x15;
                        if(size > 0)
                            vRingbufferReturnItem(rxbuf_handle, ch);
                    }
                    ack_id = 0x04;
                }
                break;
            }
            case 0x15:
            {
                httpd_resp_sendstr_chunk(req, "*");
                if ( retry_num++ > 100)
                {
                    ESP_LOGE(TAG, "retry too many times, quit!");
                    /* Respond with 500 Internal Server Error */
                    httpd_resp_sendstr_chunk(req, "Timed out trying to program flash\r\n");
                    ret = ESP_FAIL;
                    goto upload_w806_post_handler_cleanup;
                }
                else
                {
                    //send frame header
                    uart_write_bytes(W806_UART_NUM, buf, 5);

                    //clear rx buffer
                    size_t size = 0;
                    char *ch = (char *)xRingbufferReceive(rxbuf_handle, &size, 0);
                    if(size > 0)
                        vRingbufferReturnItem(rxbuf_handle, ch);

                    //send frame
                    uart_write_bytes(W806_UART_NUM, buf + 5, W806_XMODEM_DATA_SIZE);

                    //wait for ACK
                    ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);
                    if(size > 0)
                        ack_id = *ch;
                    else
                        ack_id = 0x15;
                    if(size > 0)
                        vRingbufferReturnItem(rxbuf_handle, ch);
                }
                break;
            }
            case 0x18: //waiting
            case 0x43:
            {
                httpd_resp_sendstr_chunk(req, "_");
                size_t size = 0;
                char *ch = (char *)xRingbufferReceiveUpTo(rxbuf_handle, &size, pdMS_TO_TICKS(1000), 1);
                if(size > 0) {
                    vRingbufferReturnItem(rxbuf_handle, ch);
                    ack_id = ch[size-1];
                    break;
                }
            }
            default:
            {
                ESP_LOGE(TAG, "Program failed! Unkown xmodem protocol [%x].", ack_id);
                /* Respond with 500 Internal Server Error */
                httpd_resp_sendstr_chunk(req, "Failed to program flash. Unkown xmodem protocol.\r\n");
                ret = ESP_FAIL;
                goto upload_w806_post_handler_cleanup;
            }
        }
    }

    ESP_LOGI(TAG, "File reception complete");

    /* Redirect onto root to see the updated file list */
    httpd_resp_sendstr_chunk(req, "\r\nFlash programmed successfully\r\n");
upload_w806_post_handler_cleanup:
    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_send_chunk(req, NULL, 0);
    ESP_ERROR_CHECK(uart_set_baudrate(W806_UART_NUM, previousBaudRate));
    uart_listen_remove_callback(W806_UART_NUM, rx_listen_callback_iterator);
    vRingbufferDelete(rxbuf_handle);
    bootset_w806();
    reset_w806();
    return ret;
}

/* Handler to upload flash to ATTiny */
static esp_err_t upload_attiny_post_handler(httpd_req_t *req)
{
    /* Skip leading "/upload/attiny" from URI to get refdes */
    /* Note sizeof() counts NULL termination hence the -1 */
    const char *attiny_refdes = req->uri + sizeof("/upload/attiny/") - 1;
    if (!attiny_refdes || (attiny_refdes[0] != '1' && attiny_refdes[0] != '2') || attiny_refdes[1] != 0) {
        /* Respond with 500 Internal Server Error */
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "refdes incorrect\r\n");
        return ESP_FAIL;
    }

    gpio_num_t tx_pin = UPDI1_UART_TX_PIN;
    gpio_num_t rx_pin = UPDI1_UART_RX_PIN;

    if(attiny_refdes[0] == '2' ) {
        tx_pin = UPDI2_UART_TX_PIN;
        rx_pin = UPDI2_UART_RX_PIN;
    }

